tap "homebrew/cask-fonts"

# Formulae
brew "bat"
brew "bottom"
brew "broot"
brew "btop"
brew "delta"
brew "duf"
brew "dust"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "git"
brew "jq"
brew "lsd"
brew "oh-my-posh"
brew "pipx"
brew "python@3.12"
brew "ripgrep"
brew "universal-ctags"
brew "vim"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zoxide"

# Casks
cask "bitwarden"
cask "gh"
cask "joplin"
cask "mark-text"
cask "qlmarkdown"
cask "snipaste"
cask "uv"
cask "wechat"

# Fonts
cask "font-anonymice-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-maple-mono-nf"
cask "font-sauce-code-pro-nerd-font"
